Обработки/DataProcessors/_КонтрольИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_КонтрольИнвестиционныхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвестиционнаяДекларация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПлановыеОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическийРасчетСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Претрейд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтоПретрейд</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БрокерРасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депозит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Купон</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Классификация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПогашенияДепозита</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВторойЧастиРЕПО</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаРЕПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделкаСЦентральнымКонтрагентом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дюрация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставГрупповогоКонтроля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРезультата</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговораДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_КонтрольИнвестиционныхДеклараций/Forms/ФормаНастройкиОтладки/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	
	АдресНастроек = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	ЭтаФорма.Закрыть(ПоместитьНастройкиВХранилище(АдресНастроек));
	
КонецПроцедуры

&НаСервере
Функция ПоместитьНастройкиВХранилище(АдресНастроек);

	ТекСтрока = СохраненныеНастройки.НайтиПоИдентификатору(Элементы.СохраненныеНастройки.ТекущаяСтрока);
	
	СтруктураНастроек = Новый Структура("Организация, Период, СчетДоверительногоУправления, ИнвестиционнаяДекларация, СовокупнаяИнвестДекларация, УчитыватьПлановыеОперации, ДинамическийРасчетСтоимости, РежимКонтроля, РежимГрупповогоКонтроля, Комментарий");
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ТекСтрока);
	
	СтруктураНастроек.Вставить("ИдентификаторНастроек", 			ТекСтрока.Идентификатор);
	СтруктураНастроек.Вставить("Претрейд", 							ТекСтрока.Претрейд.Выгрузить());
	СтруктураНастроек.Вставить("СоставГрупповогоКонтроля", 			ТекСтрока.СоставГрупповогоКонтроля.Выгрузить());
	СтруктураНастроек.Вставить("СоставСовокупнойИнвестДекларации", 	ТекСтрока.СоставСовокупнойИнвестДекларации.Выгрузить());
	Если ТекСтрока.РезультатСохранен Тогда
		СтруктураНастроек.Вставить("Результат", 						ПолучитьИзВременногоХранилища(ТекСтрока.Результат));	
	КонецЕсли; 
		
	ПоместитьВоВременноеХранилище(СтруктураНастроек, АдресНастроек);
	Возврат АдресНастроек;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторНастроек = Параметры.ИдентификаторНастроек;
	ЗаполнитьСохраненныеНастройки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСохраненныеНастройки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХранилищеЗначений.Идентификатор КАК Идентификатор,
		|	ХранилищеЗначений.ХранилищеЗначения КАК ХранилищеЗначения,
		|	ХранилищеЗначений.ДатаСоздания КАК ДатаСоздания,
		|	ХранилищеЗначений.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ХранилищеЗначений КАК ХранилищеЗначений
		|ГДЕ
		|	ХранилищеЗначений.Источник = ""СохраненныеНастройкиКИД""
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоздания УБЫВ,
		|	ВЫРАЗИТЬ(ХранилищеЗначений.Комментарий КАК СТРОКА(500))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеЭлементы = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ЗначениеНастройки = Выборка.ХранилищеЗначения.Получить();
		
		Если ДобавляемыеРеквизиты.Количество() = 0 Тогда
		
			Для каждого Колонка Из ЗначениеНастройки.Претрейд.Колонки Цикл
				
				РеквизитФормы = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "СохраненныеНастройки.Претрейд", Колонка.Заголовок);
				ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
				
				СвойстваЭлемента = Новый Структура;
				СвойстваЭлемента.Вставить("Имя", 			Колонка.Имя);
				СвойстваЭлемента.Вставить("ТипЭлемента", 	Тип("ПолеФормы"));
				СвойстваЭлемента.Вставить("Родитель",		Элементы.СохраненныеНастройкиПретрейд);
				СвойстваЭлемента.Вставить("ПутьКДанным", 	Элементы.СохраненныеНастройкиПретрейд.ПутьКДанным + "." + Колонка.Имя);
				СвойстваЭлемента.Вставить("Заголовок", 		Колонка.Заголовок);
				
				ДобавляемыеЭлементы.Добавить(СвойстваЭлемента);
				
			КонецЦикла; 
			
			Для каждого Колонка Из ЗначениеНастройки.СоставГрупповогоКонтроля.Колонки Цикл
				
				РеквизитФормы = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "СохраненныеНастройки.СоставГрупповогоКонтроля", Колонка.Заголовок);
				ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
				
				СвойстваЭлемента = Новый Структура;
				СвойстваЭлемента.Вставить("Имя", 			Колонка.Имя);
				СвойстваЭлемента.Вставить("ТипЭлемента", 	Тип("ПолеФормы"));
				СвойстваЭлемента.Вставить("Родитель", 		Элементы.СохраненныеНастройкиСоставГрупповогоКонтроля);
				СвойстваЭлемента.Вставить("ПутьКДанным", 	Элементы.СохраненныеНастройкиСоставГрупповогоКонтроля.ПутьКДанным + "." + Колонка.Имя);
				СвойстваЭлемента.Вставить("Заголовок", 		Колонка.Заголовок);
				
				ДобавляемыеЭлементы.Добавить(СвойстваЭлемента);
				
			КонецЦикла; 
			
			Если ТипЗнч(ЗначениеНастройки.СоставСовокупнойИнвестДекларации) = Тип("ТаблицаЗначений") Тогда
			
				Для каждого Колонка Из ЗначениеНастройки.СоставСовокупнойИнвестДекларации.Колонки Цикл
					
					РеквизитФормы = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "СохраненныеНастройки.СоставСовокупнойИнвестДекларации", Колонка.Заголовок);
					ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
					
					СвойстваЭлемента = Новый Структура;
					СвойстваЭлемента.Вставить("Имя", 			Колонка.Имя);
					СвойстваЭлемента.Вставить("ТипЭлемента", 	Тип("ПолеФормы"));
					СвойстваЭлемента.Вставить("Родитель", 		Элементы.СохраненныеНастройкиСоставСовокупнойИнвестДекларации);
					СвойстваЭлемента.Вставить("ПутьКДанным", 	Элементы.СохраненныеНастройкиСоставСовокупнойИнвестДекларации.ПутьКДанным + "." + Колонка.Имя);
					СвойстваЭлемента.Вставить("Заголовок", 		Колонка.Заголовок);
					
					ДобавляемыеЭлементы.Добавить(СвойстваЭлемента);
					
				КонецЦикла; 				
			
			КонецЕсли; 
				
			ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			Для каждого Элемент Из ДобавляемыеЭлементы Цикл
			
				НовыйЭлемент = ЭтаФорма.Элементы.Добавить(Элемент.Родитель.Имя + Элемент.Имя, Элемент.ТипЭлемента, Элемент.Родитель);
				НовыйЭлемент.ПутьКДанным 	= Элемент.ПутьКДанным;
				НовыйЭлемент.Вид     		= ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.Заголовок   	= Элемент.Заголовок;
			
			КонецЦикла; 
					
		КонецЕсли; 
		
		НоваяСтрока = ЭтаФорма.СохраненныеНастройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗначениеНастройки,, "Претрейд, СоставГрупповогоКонтроля, СоставСовокупнойИнвестДекларации");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Претрейд.Загрузить(ЗначениеНастройки.Претрейд);
		НоваяСтрока.СоставГрупповогоКонтроля.Загрузить(ЗначениеНастройки.СоставГрупповогоКонтроля);
		Если ТипЗнч(ЗначениеНастройки.СоставСовокупнойИнвестДекларации) = Тип("ТаблицаЗначений") Тогда
		
			НоваяСтрока.СоставСовокупнойИнвестДекларации.Загрузить(ЗначениеНастройки.СоставСовокупнойИнвестДекларации);
		
		КонецЕсли; 
				
		Если ЗначениеНастройки.Свойство("Результат") Тогда
			НоваяСтрока.РезультатСохранен = Истина;
			НоваяСтрока.Результат = ПоместитьВоВременноеХранилище(ЗначениеНастройки.Результат, ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;
			
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СохраненныеНастройкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗагрузитьНастройки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СохраненныеНастройкиПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.СохраненныеНастройки.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТекСтрока.Претрейд.Количество() > 0 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПретрейд;
	ИначеЕсли ТекСтрока.СоставГрупповогоКонтроля.Количество() > 0 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаГрупповойКонтроль;
	ИначеЕсли ТекСтрока.СовокупнаяИнвестДекларация Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСоставСовокупнойИнвестДекларации;
	КонецЕсли;
	
КонецПроцедуры
